# На осемнадесетия си рожден ден Хосе взел решение, че ще се изнесе да живее на квартира.
# Опаковал багажа си в кашони и намерил подходяща обява за апартамент под наем.
# Той започва да пренася своя багаж на части, защото не може наведнъж.
# Има ограничено свободно пространство в новото си жилище, където може да разположи вещите,
# така че мястото да бъде подходящо за живеене.
# Напишете програма, която изчислява свободния обем от жилището на Хосе, който остава, след като пренесе багажа си.
# Всеки кашон е с точни размери:  1m x 1m x 1m.
# Вход
# Потребителят въвежда следните данни на отделни редове:
#     1. Широчина на свободното пространство - цяло число;
#     2. Дължина на свободното пространство - цяло число;
#     3. Височина на свободното пространство - цяло число;
#     4. На следващите редове (до получаване на команда "Done") - брой кашони,
#     които се пренасят в квартирата - цели числа
# Програмата трябва да приключи прочитането на данни при команда "Done" или ако свободното място свърши.

space_width = int(input())
space_length = int(input())
space_height = int(input())

space_total_size = space_width * space_length * space_height

while True:
    new_input = input()
    if new_input == "Done":
        print(f"{space_total_size} Cubic meters left.")
        break

    space_total_size -= int(new_input)

    if space_total_size <= 0:
        print(f"No more free space! You need {abs(space_total_size)} Cubic meters more.")
        break