# Лили вече е на N години. За всеки свой рожден ден тя получава подарък.
#     • За нечетните рождени дни (1, 3, 5...n) получава играчки.
#     • За четните рождени дни (2, 4, 6...n) получава пари.
# За втория рожден ден получава 10.00 лв, като сумата се увеличава с 10.00 лв.,
# за всеки следващ четен рожден ден (2 -> 10, 4 -> 20, 6 -> 30...и т.н.).
# През годините Лили тайно е спестявала парите. Братът на Лили, в годините,
# които тя получава пари, взима по 1.00 лев от тях. Лили продала играчките получени през годините,
# всяка за P лева и добавила сумата към спестените пари. С парите искала да си купи пералня за X лева.
# Напишете програма, която да пресмята, колко пари е събрала и дали ѝ стигат да си купи пералня.

lily_age = int(input())
washer_price = float(input())
single_toy_price = float(input())

toys = 0
savings = 0
counter = 1

for age in range(1, lily_age + 1):
    if age % 2 != 0:
        toys += 1
    if age % 2 == 0:
        savings += 10 * counter
        savings -= 1
        counter += 1

toys_price = toys * single_toy_price
savings += toys_price

if savings >= washer_price:
    print(f'Yes! {savings - washer_price:.2f}')
elif savings < washer_price:
    print(f'No! {washer_price - savings:.2f}')
