# Да се напише програма, която чете час и минути от 24-часово денонощие,
# въведени от потребителя и изчислява колко ще е часът след 15 минути.
# Резултатът да се отпечата във формат часове:минути. Часовете винаги са между 0 и 23,
# а минутите винаги са между 0 и 59. Часовете се изписват с една или две цифри.
# Минутите се изписват винаги с по две цифри, с водеща нула, когато е необходимо. //1 46

hour = int(input())
minutes = int(input())

hour_plus_15_minutes = minutes + 15

if hour_plus_15_minutes - 60 >= 0: #ако са повече от 60, има останали минути и се увеличава часа
    hour += 1
    hour_plus_15_minutes -= 60 #вадим от общите минути 60 минути, за да останат реалните минути

if hour > 23:
    hour = 0

if hour_plus_15_minutes < 10:
    print(f'{hour}:0{hour_plus_15_minutes}')
else:
    print(f'{hour}:{hour_plus_15_minutes}')