# Напишете програма, която извежда на конзолата номерата на стаите в една сграда (в низходящ ред),
# като са изпълнени следните условия:
#     • На всеки четен етаж има само офиси;
#     • На всеки нечетен етаж има само апартаменти;
#     • Всеки апартамент се означава по следния начин : А{номер на етажа}{номер на апартамента},
#     номерата на апартаментите започват от 0;
#     • Всеки офис се означава по следния начин : О{номер на етажа}{номер на офиса},
#     номерата на офисите също започват от 0;
#     • На последният етаж винаги има апартаменти и те са по-големи от останалите, затова пред
#     номера им пише 'L', вместо 'А'. Ако има само един етаж, то има само големи апартаменти!
# От конзолата се прочитат две цели числа - броят на етажите и броят на стаите за един етаж.

floors = int(input())
flats_per_floor = int(input())
flat_name = ''

for floor_number in range(floors, 0, - 1):
    for flat_number in range(flats_per_floor):

        if floor_number == floors:
            flat_name = f'L{floor_number}{flat_number}'
        elif floor_number % 2 == 0:
            flat_name = f'O{floor_number}{flat_number}'
        elif floor_number % 2 != 0:
            flat_name = f'A{floor_number}{flat_number}'

        print(flat_name, end=" ")
    print()

